#+TITLE: Processament de les dades de la llista TOP500
#+SUBTITLE: Tractament de les dades per preparar-les i obtenir-ne informació
#+DESCRIPTION: Pràctica de Tipologia i cicle de vida de les dades, quadrimestre Febrer—Juny 2018
#+DATE: <2018-06-10 Sun>
#+AUTHOR: Pep Turró Mauri
#+EMAIL: jturro@uoc.edu
#+KEYWORDS: tipologia, dades, data science, top500, UOC
#+CREATOR: Emacs 25.3.1 (Org mode 8.2.10)
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:t p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:t
#+OPTIONS: todo:t |:t
#+OPTIONS: texht:t
# from org-mode-R-tutorial:
#+OPTIONS:    H:3 num:t toc:2 \n:nil @:t ^:{} TeX:t LaTeX:t skip:t d:(HIDE) tags:not-in-toc
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate 
#+EXCLUDE_TAGS: noexport
#+LANGUAGE: en
#+PROPERTY: header-args:R :tangle yes  :session *R* :results value :exports results
# http://www.tex.ac.uk/FAQ-fixnam.html
#+LaTeX_HEADER: \renewcommand{\contentsname}{Índex}
#+LaTeX_HEADER: \renewcommand{\figurename}{Figura}
#+LaTeX_HEADER: \renewcommand{\tablename}{Taula}
#+LaTeX_HEADER: \renewcommand{\referencesname}{Bibliografia}
#+LATEX_HEADER: \usepackage{url}
# http://orgmode.org/worg/org-contrib/babel/examples/article-class.html#latex-classfile
#+LATEX_HEADER: \usepackage[hyperref,x11names]{xcolor}
#+LaTeX_CLASS_OPTIONS: [a4paper,colorlinks,urlcolor=SteelBlue4,linkcolor=Firebrick4,pdfusetitle]

** Correcció d'unitats

Durant l'elaboració d'aquest anàlisi vaig adonar-me d'un problema que va passar
desapercebut durant la captura de les dades: en un punt de la història de les
llistes TOP500 les unitats de mesura de la potència de càlcul van passar de
GFlop/s a TFlop/s!

Ho podem veure si mirem la progressió de /rmax/ de l'ordinador més potent per
anys:

#+BEGIN_SRC R :exports both
  # Veure com hi ha un canvi d'ordre de magnitud a rmax
  top500[top500$rank == 1 & top500$month == 6, c('year', 'rmax')]
#+END_SRC

#+RESULTS:
#+begin_example
      year    rmax
1     1993    59.7
1001  1994   143.4
2001  1995   170.0
3001  1996   220.4
4001  1997  1068.0
5001  1998  1338.0
6001  1999  2121.0
7001  2000  2379.0
8001  2001  7226.0
9001  2002 35860.0
10001 2003 35860.0
11001 2004 35860.0
12001 2005   136.8
13001 2006   280.6
14001 2007   280.6
15001 2008  1026.0
16001 2009  1105.0
17001 2010  1759.0
18001 2011  8162.0
19001 2012 16324.8
20001 2013 33862.7
21001 2014 33862.7
22001 2015 33862.7
23001 2016 93014.6
24001 2017 93014.6
#+end_example

He verificat que a partir de la llista del Juny de 2005 (edició número 25) tots
els valors de /rmax/ i /rpeak/ són en TFlop/s[fn:1], mentre que a totes les
edicions anteriors estaven en GFlop/s[fn:2].

Corregirem doncs els valors perquè estiguin tots en la mateixa unitat (GFlop/s):

#+BEGIN_SRC R :exports code :results silent
  # Passem les mesures més recents, que estan en TFlops, a GFlops per
  # tal que els valors de rmax i rpeak estiguin en la mateixa unitat
  top500[top500$edition > 24, 'rmax'] <- 1000 *
      top500[top500$edition > 24, 'rmax']
  top500[top500$edition > 24, 'rpeak'] <- 1000 *
      top500[top500$edition > 24, 'rpeak']
#+END_SRC

*** Mateix fabricant amb diferent nom

#+BEGIN_SRC R :results siltent :exports none
  # Ens guardem quants fabricants diferents hi ha a les dades originals
  fabricants <- nlevels(top500$manufacturer)
#+END_SRC

#+RESULTS:
: 124

La variable /manufacturer/ (el fabricant de l'ordinador) té uns quants casos de
valors que són duplicats amb certes variacions, com per exemple /"Cray
Computer"/ i /"Cray Inc."/, que voldrem unir sota un únic valor.

En certs casos no és tan evident, ja que hi ha ordinadors que tenen parts
de diferents fabricants. Per exmple, tenim /"Dell/Sun/IBM"/ o /"IBM/HP"/.
Per tal de simplificar, en aquests casos assumeixo que el primer dels fabricants
mencionats és el principal i els unifico com a tals:

#+BEGIN_SRC R :exports code :results silent
  # Unifiquem noms de fabricants
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     '^Cray', 'Cray')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     '^Dell', 'Dell', ignore.case = TRUE)
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     '^(IBM|Lenovo)', 'IBM')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     '^(HP|Hewlett)', 'HP')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'Fujitsu', 'Fujitsu')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'NEC', 'NEC')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'Hitachi', 'Hitachi')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'ClusterVision', 'ClusterVision')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'T-Platforms', 'T-Platforms')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'NSSOL', 'NSSOL')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'SGI|Networx', 'SGI')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'Kendall|KSR', 'KSR')
  top500$manufacturer <- mergelevels(top500$manufacturer, 'Raytheon',
                                     'Raytheon-Aspen Systems')
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'supermicro', 'SuperMicro',
                                     ignore.case = TRUE)
  # Unifiquem diversos dissenys propis del NRCPC a la Xina
  top500$manufacturer <- mergelevels(top500$manufacturer,
                                     'NRCPC|National Research|University',
                                     'Self-made')
#+END_SRC

Després de d'aquestes correccions hem rebaixat el nombre de fabricants diferents
de src_R{fabricants} a src_R{nlevels(top500$manufacturer)}.

** Valors perduts, zeros o buits
   :PROPERTIES:
   :CUSTOM_ID: valors-nuls
   :END:
# Les dades contenen zeros o elements buits? Com gestionaries aquests casos?

La funció ~summary~ ens ajuda a trobar quines variables conenen valors buits (i
quants) i fer-nos una idea del rang de valors cobert, i detectar per tant la
presència de zeros que poden ser indicatius d'un error a les dades:

#+BEGIN_SRC R :exports both :results output
  # El resum del data frame ens permet veure quines variables
  # contenen NAs
  summary(top500)
#+END_SRC

#+RESULTS:
#+begin_example
    manufacturer      cores              memory       
 HPE      :7918   Min.   :       1   Min.   :      8  
 IBM      :7043   1st Qu.:      96   1st Qu.:  14976  
 Cray Inc.:2989   Median :     960   Median :  48384  
 Oracle   :1224   Mean   :   16853   Mean   : 117538  
 Fujitsu  : 702   3rd Qu.:    9504   3rd Qu.: 125440  
 NEC      : 597   Max.   :19860000   Max.   :7685540  
 (Other)  :4527                      NA's   :21379    
                  processor               interconnect        rmax        
 Xeon E5-2670 8C 2.6GHz: 1120   Gigabit Ethernet: 5053   Min.   :    0.4  
 POWER3  375MHz        :  597   Infiniband      : 1399   1st Qu.:   10.3  
 POWER2  66MHz         :  553   SP Switch       : 1378   Median :   55.7  
 Xeon E5450 4C 3GHz    :  529   10G Ethernet    : 1349   Mean   :  368.5  
 R10000  195MHz        :  469   Infiniband FDR  : 1301   3rd Qu.:  277.8  
 PowerPC 604e  332MHz  :  444   (Other)         :10293   Max.   :93014.6  
 (Other)               :21288   NA's            : 4227                    
     rpeak               nmax              nhalf              hpcg       
 Min.   :     0.5   Min.   :    1900   Min.   :    112   Min.   :  1.70  
 1st Qu.:    15.2   1st Qu.:   23000   1st Qu.:   2400   1st Qu.: 31.50  
 Median :    85.4   Median :  200000   Median :   5200   Median : 80.79  
 Mean   :   574.2   Mean   :  983267   Mean   :  48915   Mean   :141.78  
 3rd Qu.:   416.4   3rd Qu.: 1486952   3rd Qu.:  18560   3rd Qu.:167.05  
 Max.   :125435.9   Max.   :16662804   Max.   :1834944   Max.   :602.74  
                    NA's   :14068      NA's   :18993     NA's   :24610   
     power                       os                         compiler    
 Min.   :   18.0   Linux          :10990   Intel                :   90  
 1st Qu.:  172.0   AIX            : 2843   icc                  :   83  
 Median :  374.0   UNICOS         : 2000   Intel 12.1           :   82  
 Mean   :  862.5   IRIX           : 1314   GCC                  :   75  
 3rd Qu.:  831.0   HP Unix (HP-UX): 1294   intel parallel studio:   44  
 Max.   :19431.0   Solaris        : 1091   (Other)              :  653  
 NA's   :17970     (Other)        : 5468   NA's                 :23973  
               math                                      mpi       
 MKL             :  228   Intel MPI                        :  248  
 Intel MKL       :  188   MVAPICH 1.2                      :   60  
 mkl             :   43   OPEN MPI                         :   40  
 MKL - 11.3.3.210:   33   MPICH2 with a custom GLEX channel:   36  
 MKL,CUDA6.5     :   23   Intel MPI 4.0                    :   34  
 (Other)         :  335   (Other)                          :  658  
 NA's            :24150   NA's                             :23924  
               gpu                  country        system_id    
 GigE            :  448   United States :12675   174016 :   16  
 Gig-Ethernet    :  334   Japan         : 2346   176819 :   16  
 Custom          :  301   Germany       : 1924   176908 :   16  
 Xeon 54xx 3.0GHz:  263   China         : 1695   176899 :   15  
 Xeon 51xx 3.0GHz:  171   United Kingdom: 1446   176924 :   15  
 (Other)         : 5274   France        : 1026   176928 :   15  
 NA's            :18209   (Other)       : 3888   (Other):24907  
         city             segment           year           rank      
 Tokyo     :  549   Academic  : 5010   Min.   :1993   Min.   :  1.0  
 Livermore :  368   Classified:  432   1st Qu.:1999   1st Qu.:125.8  
 Los Alamos:  336   Government: 1009   Median :2005   Median :250.5  
 Houston   :  331   Industry  :11601   Mean   :2005   Mean   :250.5  
 Beijing   :  317   Others    :    7   3rd Qu.:2011   3rd Qu.:375.2  
 (Other)   :12893   Research  : 6110   Max.   :2017   Max.   :500.0  
 NA's      :10206   Vendor    :  831
#+end_example

De la sortida en podem destacar uns quants aspectes:

  - Les variables /rpeak/ i /rmax/ no contenen valors buits (/NA/), però
    aparenten tenir zeros (Min == 0). Cal notar que per aquestes variables el
    zero no és un valor vàlid: qualsevol ordinador té una velocitat de càlcul
    superior a 0. Al verificar les dades, però, resulten ser els sistemes en les
    darreres posicions de les primeres llistes, amb velocitats de càlcul
    inferior a 1 GFlop/s (fraccions entre 0 i 1). És a dir: en aquestes dues
    variables, fonamentals per l'anàlisi, no hi ha valors buits o zeros.

  - Altres variables sense valors buits o zeros i que poden ser útils per
    anàlisi són: /segment/, /country/, /manufacturer/, /cores/

  - Hi ha algunes variables que contenen un nombre molt elevat de valors nuls
    (més de la meitat de les observacions, en alguns casos la pràctica
    totalitat): /math/, /hpcg/, /nmax/, /nhalf/, /power/, /compiler/, /mpi/,
    /gpu/, /memory/.

  - Altres variables contenen valors buits però en una proporció menor:
    /interconnect/, /os/.

En resum: tenim algunes variables de bona qualitat, sense valors nuls o invàlids
i que són rellevants per a l'anàlisi. D'altres contenen valors nuls, que són
vàlids en el sentit que reflexen la manca d'informació.

No faré cap més tractament d'aquests valors perduts, els mantindrem tal i com
estan. Les alternatives per tractar-los no tenen sentit en aquest cas: no volem
descartar registres sencers només perquè els manca informació de, per exemple,
quin compilador fan servir; tampoc tenim a l'abast omplir la informació que
falta; no té gaire sentit tampoc en el nostre cas intentar calcular valors per
les variables afectades, sobretot a les variables on la majoria dels valors són
buits (i a les que no, com /os/, un valor calculat no ens aportaria més valor
per a l'anàlisi que un valor buit). Simplement acceptarem aquesta presència de
valors buits i ho tindrem en compte a l'hora de l'anàlisi. Amb un parell
d'excepcions, però, que veurem a continuació.

*** Familia de Sistema Operatiu
    :PROPERTIES:
    :CUSTOM_ID: osfamily
    :END:

Anteriorment hem [[*Sistemes operatius duplicats][simplificat la informació de sistemes operatius]] eliminant
detalls de versió que no són rellevants per als anàlisi. Tot i això, encara
ens queden src_R{nlevels(top500$os)} sistemes operatius diferents, i de cara
a analitzar l'evolució dels sistemes operatius dels superordinadors ens pot
anar bé tenir-los agrupats per famílies o tipus de sistema operatiu.

Crearem un nou atribut /osfamily/ agrupant els sistemes operatius en 3 grans
families: "Unix", "Linux" i "Windows".

#+BEGIN_SRC R :exports both
  # Agrupació de sistemes operatius per families
  top500$osfamily <- top500$os

  linux <- c(
      'Linux', 'Ubuntu', 'CentOS', 'Bullx', 'RaiseOS', 'TOSS', 'CNL'
  )
  top500$osfamily <- mergelevels(top500$osfamily,
                                 paste0(linux, collapse="|"),
                                 'Linux', ignore.case = TRUE)

  unix <- c(
      'AIX', 'IRIX', 'HP', 'Unix', 'CMOST', 'Solaris', 'SunOS',
      'MacOS', 'HI-UX', 'Ultrix', 'PARIX', 'Super-UX', 'UNICOS',
      'ConvexOS', 'SPP-UX', 'Tru64', 'OSF/1', 'KSR', 'EWS', 'UXP'
  )
  top500$osfamily <- mergelevels(top500$osfamily,
                                 paste0(unix, collapse = "|"),
                                 'Unix', ignore.case = TRUE)

  other <- c('Cell OS', 'CRS-OS', 'NX/2', 'Paragon')
  top500$osfamily <- mergelevels(top500$osfamily,
                                 paste0(other, collapse="|"),
                                 'Other')
  table(top500$osfamily)
#+END_SRC

#+RESULTS:
| Unix    | 11457 |
| Linux   | 13280 |
| Other   |   126 |
| Windows |    50 |

** Aplicació de proves estadístiques
   :PROPERTIES:
   :CUSTOM_ID: tests
   :END:
# ... per comparar els grups de dades.
#
# En funció de les dades i de l’objectiu de l’estudi, aplicar proves de contrast
# d’hipòtesis, correlacions, regressions, etc.

Anem a veure quina de les tres variables /memory/, /cores/ i /power/ té més
relació amb el rendiment dels ordinadors (/rmax/).

Per fer-ho aplicarem un model de regressió entre /rmax/ i cadascuna d'elles,
compararem quin encaixa millor i quins són els respectius índex de correlació.

#+BEGIN_SRC R :exports both :results output
  # Regressió entre rmax i cores
  rmaxcores <- lm(log10(top500$rmax) ~ log10(top500$cores))
  summary(rmaxcores)
#+END_SRC

#+RESULTS:
#+begin_example

Call:
lm(formula = log10(rmax) ~ log10(cores))

Residuals:
    Min      1Q  Median      3Q     Max 
-4.2254 -0.2339  0.0703  0.3124  2.2617 

Coefficients:
              Estimate Std. Error t value Pr(>|t|)    
(Intercept)  -0.873142   0.009574   -91.2   <2e-16 ***
log10(cores)  1.419542   0.003015   470.9   <2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.5879 on 24998 degrees of freedom
Multiple R-squared:  0.8987,	Adjusted R-squared:  0.8987 
F-statistic: 2.217e+05 on 1 and 24998 DF,  p-value: < 2.2e-16
#+end_example

#+BEGIN_SRC R :exports both :results output
  # Regressió entre rmax i memory
  rmaxmem <- lm(log10(top500$rmax) ~ log10(top500$memory))
  summary(rmaxmem)
#+END_SRC

#+RESULTS:
#+begin_example

Call:
lm(formula = log10(top500$rmax) ~ log10(top500$memory))

Residuals:
    Min      1Q  Median      3Q     Max 
-3.4195 -0.2610 -0.0287  0.2525  2.3887 

Coefficients:
                     Estimate Std. Error t value Pr(>|t|)    
(Intercept)           1.16229    0.04825   24.09   <2e-16 ***
log10(top500$memory)  0.91416    0.01036   88.20   <2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.4453 on 3619 degrees of freedom
  (21379 observations deleted due to missingness)
Multiple R-squared:  0.6825,	Adjusted R-squared:  0.6824 
F-statistic:  7780 on 1 and 3619 DF,  p-value: < 2.2e-16
#+end_example

#+BEGIN_SRC R :exports both :results output
  # Regressió entre rmax i power
  rmaxpower <- lm(log10(top500$rmax) ~ log10(top500$power))
  summary(rmaxpower)
#+END_SRC

#+RESULTS:
#+begin_example

Call:
lm(formula = log10(top500$rmax) ~ log10(top500$power))

Residuals:
     Min       1Q   Median       3Q      Max 
-2.86498 -0.35771 -0.06859  0.43162  1.82276 

Coefficients:
                    Estimate Std. Error t value Pr(>|t|)    
(Intercept)          2.19657    0.03621   60.66   <2e-16 ***
log10(top500$power)  1.12273    0.01362   82.43   <2e-16 ***
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Residual standard error: 0.5766 on 7028 degrees of freedom
  (17970 observations deleted due to missingness)
Multiple R-squared:  0.4915,	Adjusted R-squared:  0.4915 
F-statistic:  6794 on 1 and 7028 DF,  p-value: < 2.2e-16
#+end_example

Comparant els índex de correlació $R^2$ veiem que la variable /cores/ (número de
nuclis) és la que presenta una correlació més elevada, de 0.899, mentre que en
el cas de /power/ (consum) baixa fins a 0.49.

A l'apartat següent representarem gràficament aquestes [[#relations][relacions entre potència]] i les altres
variables i ho confirmarem de manera més visual.

Comentar també que aquí tornem a veure la presència de valors buits a les
dades: a part de /rmax/, només /cores/ conté valors a tots els registres, mentre
que per a /power/ i sobretot /memory/ s'han descartat automàticament un gran
nombre d'entrades per tenir valor buit.

